_refs/diagrams-og/activities/Redaguoti_lankytinas_vietą.puml
@startuml activity_Redaguoti_lankytinas_vietą
skinparam style strictuml
skinparam swimlane {
  BorderColor #555
}
skinparam activity {
  BackgroundColor #FFFDE7
  BorderColor #F9A825
  DiamondBackgroundColor #E3F2FD
  DiamondBorderColor #1565C0
}

|Admin|
start
:Pasirinkti pridėjimą;
|Administratoriaus posistemė|
:Pateikti redagavimo formą;
|Admin|
:Užpildyti redagavimo formą ir patvirtinti;
|Administratoriaus posistemė|
:Patikrinti ar įvesti teisingi duomenų tipai;
:Patiktinti ar lankytina vieta nesidubliuoja sistemoje;
if () then ([duomenys tinkami])
else ([else])
  :Pateikti klaidos pranešimą ir klaidingą duomenų lauką redagavimo formoje;
endif
:Redaguoti lankytiną vietą;
stop

@enduml
